УТ_для_edt/src/DataProcessors/смартЗагрузкаЗаявокНаРемонтныеРаботыИзПочты/смартЗагрузкаЗаявокНаРемонтныеРаботыИзПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартЗагрузкаЗаявокНаРемонтныеРаботыИзПочты</name>
  <comment>// #082 10.02.2021</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/смартВидыКвалификацийИнженеровСЦ/смартВидыКвалификацийИнженеровСЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВидыКвалификацийИнженеровСЦ</name>
  <comment>#Б-2770 смарт: Лопато 26.03.2025 //Создание механизма учета квалификации инженеров СЦ.</comment>
  <resources>
    <name>Запуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапускРучноеИзменение</name>
    <type>
      <types>EnumRef.смартРучнаяКорректировкаКвалификаций</types>
    </type>
  </resources>
  <resources>
    <name>РемонтРучноеИзменение</name>
    <type>
      <types>EnumRef.смартРучнаяКорректировкаКвалификаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗапускРучноеИзменениеАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>РемонтРучноеИзменениеАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ЗапускДатаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РемонтДатаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартОборудованиеЧернилаКлиентов/смартОборудованиеЧернилаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОборудованиеЧернилаКлиентов</name>
  <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
  <resources>
    <name>Количество</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МотоРесурс</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеКлиентов</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СопоставлениеСТоваром</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыЗаявокНаРемонтныеРаботы/смартСтатусыЗаявокНаРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыЗаявокНаРемонтныеРаботы</name>
  <comment>//смарт:ММ #082 397 11.11.2020</comment>
  <enumValues>
    <name>НоваяЗаявка</name>
  </enumValues>
  <enumValues>
    <name>ПолученаВРаботу</name>
  </enumValues>
  <enumValues>
    <name>ДиагностикаПроведена</name>
    <comment>//++ #Б-4814 смарт: Фролов 23.10.2025 //Добавление нового статуса в заявку на ремонтные работы.</comment>
  </enumValues>
  <enumValues>
    <name>СозвонилисьСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>ОтправленаВПредставительство</name>
  </enumValues>
  <enumValues>
    <name>НазначенИнженер</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПовторныйВыезд</name>
  </enumValues>
  <enumValues>
    <name>РемонтЗавершен</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйВыезд</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаАннулирована</name>
    <comment>// смарт:ММ 18.05.2021</comment>
  </enumValues>
  <enumValues>
    <name>РемонтОсуществленПоТелефону</name>
    <comment>// смарт:ММ 18.05.2021</comment>
  </enumValues>
  <enumValues>
    <name>ОшибочнаяЗаявка</name>
    <comment>// смарт:ММ 13.08.2021</comment>
  </enumValues>
  <enumValues>
    <name>ЖдемЗапчасти</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыГарантии/смартВидыГарантии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыГарантии</name>
  <comment>//смарт:ММ #082 397 28.02.2021</comment>
  <enumValues>
    <name>Гарантия</name>
  </enumValues>
  <enumValues>
    <name>Платная</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГенеральныйДиректор</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБухгалтер</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветственныйЗаЭДО</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>EnumRef.смартСтатусыКонтактныхДанныхКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДатаОбновленияПоДаннымФНС</name>
    <comment>// смарт:ММ 08.10.2020 #076</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <comment>// смарт:ММ 03.11.2020 #076</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЛизинговаяКомпания</name>
    <comment>//++ #1334 смарт: Фролов 17.04.2023 //Заявка на формирование и подписание договора из 1С </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтправлятьВсеДокументыЧерезЭДО</name>
    <comment>#1652 смарт: Ермаков 26,06,2024 / Доработка карточки Контрагента</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартЗагрузкаЗаявокНаРемонтныеРаботыИзПочты/ManagerModule.bsl
#Область Интерфейс

Функция ЗагрузитьЗаявкиИзПочты(ДатаПисем = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаПисем) Тогда
		ДатаПисем = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	ЭлектронныйАдрес = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("АдресПочтыЗагрузкиЗаявокНаРемонт");
	Пароль = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки("ПарольПочтыЗагрузкиЗаявокНаРемонт");
	
	МассивДокументов = Новый Массив;
	ПочтовыйПрофиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(), Истина);
	
	ПочтовыйПрофиль.Пароль = Пароль;
	ПочтовыйПрофиль.ПарольSMTP = Пароль;
	ПочтовыйПрофиль.Пользователь = ЭлектронныйАдрес;
	ПочтовыйПрофиль.ПользовательSMTP = ЭлектронныйАдрес;
	ПочтовыйПрофиль.ПользовательIMAP = ЭлектронныйАдрес;
	ПочтовыйПрофиль.ПарольIMAP = Пароль;
	
	ИнтернетПочта = Новый ИнтернетПочта;
	Попытка
		ИнтернетПочта.Подключиться(ПочтовыйПрофиль, ПротоколИнтернетПочты.IMAP);
	Исключение
		
		ТекстОшибки = СтрШаблон("Не удалось подключиться к почте по причине :%1%2 ", Символы.ПС, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
		Возврат МассивДокументов;
		
	КонецПопытки;

	ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("ПослеДатыОтправления", ДатаПисем);
	
	МассивЗаголовков = ИнтернетПочта.ПолучитьЗаголовки(ПараметрыОтбора);
	МассивЗаголовковТекущаяДата = Новый Массив;
	
	// Отборы по дате не сработали, вручную отбор сообщений за текущий день
	Для Каждого ТекущийЗаголовок Из МассивЗаголовков Цикл
		
		Если ТекущийЗаголовок.ДатаОтправления >= ДатаПисем 
			И ТекущийЗаголовок.ДатаОтправления <= КонецДня(ДатаПисем) 
            И СтрНайти(ТекущийЗаголовок.Тема,"заявка")<>0
            Тогда
			
			МассивЗаголовковТекущаяДата.Добавить(ТекущийЗаголовок);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЗаголовковТекущаяДата.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, "На сервере новых сообщений нет");
		ОбщегоНазначения.СообщитьПользователю("На сервере новых сообщений нет.");
		
		Возврат МассивДокументов;
		
	КонецЕсли;	
	
	Сообщения = ИнтернетПочта.Выбрать(Ложь, МассивЗаголовковТекущаяДата, Ложь);
	
	Если Сообщения.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, "На сервере новых сообщений нет");
		ОбщегоНазначения.СообщитьПользователю("На сервере новых сообщений нет.");
		
		Возврат МассивДокументов;
		
	Иначе
		
		// 1. Получить номер заявки из текста письма
		// 2. Найти заявку в базе. Если такой нет, то пункты 3, 4						
		// 3. Прочитать все поля из текста письма		
		// 4. Создать новый документ Заявка на ремонтные работы
		
		Организация = Справочники.смартПредопределенныеЗначения.ОрганизацияДляЗаявкиНаГарантийныйРемонт.Значение;
		
		Для Каждого ТекущееСообщение Из Сообщения Цикл
			
			Если ТекущееСообщение.Тексты.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстПисьма = "";
			Разделитель = Символы.ПС;
			ИнтернетТекстПочтовогоСообщения = ТекущееСообщение.Тексты[0];
			Если ИнтернетТекстПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда
				ТекстПисьма = ПолучитьЧистыйТекстИзHTML(ИнтернетТекстПочтовогоСообщения.Текст);
			Иначе
				ТекстПисьма = ИнтернетТекстПочтовогоСообщения.Текст;
			КонецЕсли;
						
			МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПисьма, Разделитель, Истина, Истина);			
			
			НомерЗаявки = "";
			Для Каждого СтрокаСообщения Из МассивСтрок Цикл
				
				Если СтрНайти(СтрокаСообщения, "Номер заявки:") <> 0 Тогда
					
					ДлинаСтроки = СтрДлина(СтрокаСообщения);
					НомерЗаявки = СокрЛП(Прав(СтрокаСообщения, ДлинаСтроки - 13));
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(НомерЗаявки) Тогда
				
				ТекстСообщенияНачало = "E-mail от " + Формат(ТекущееСообщение.ДатаОтправления, "ДФ='dd.MM.yyyy ""г.""'") + " по заявке №" + НомерЗаявки + ": ";
				
				НомерЗаявки = Лев(НомерЗаявки, 10);
				ВБазеЕстьДокументСНомером = ПроверитьНаличиеДокумента(НомерЗаявки, ДатаПисем);
				
				Если НЕ ВБазеЕстьДокументСНомером Тогда
										
					СтруктураДанныеИзПисьма = Новый Структура;
					СтруктураДанныеИзПисьма.Вставить("Номер", НомерЗаявки);
					СтруктураДанныеИзПисьма.Вставить("ИНН", "");
					СтруктураДанныеИзПисьма.Вставить("КонтрагентИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("Контрагент", "");
					СтруктураДанныеИзПисьма.Вставить("КонтактноеЛицо", "");
					СтруктураДанныеИзПисьма.Вставить("КонтактноеЛицоИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("ТелефонКонтактногоЛица", "");
					СтруктураДанныеИзПисьма.Вставить("АдресЭПКонтактногоЛица", "");
					СтруктураДанныеИзПисьма.Вставить("ТелефонИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("АдресЭПИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("ГородИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("Представительство", "");
					СтруктураДанныеИзПисьма.Вставить("АдресИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("ОборудованиеКлиентов", "");
					СтруктураДанныеИзПисьма.Вставить("ОборудованиеКлиентовИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("Серия", "");
					СтруктураДанныеИзПисьма.Вставить("СерияИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("НаличиеГарантии", "");
					СтруктураДанныеИзПисьма.Вставить("ТипЧернил", "");
					СтруктураДанныеИзПисьма.Вставить("ТипЧернилИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("КонфигурацияЧернил", "");
					СтруктураДанныеИзПисьма.Вставить("КонфигурацияЧернилИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("РастровыйПроцессор", "");
					СтруктураДанныеИзПисьма.Вставить("РастровыйПроцессорИзПисьма", "");
					СтруктураДанныеИзПисьма.Вставить("ЖелаемаяДатаРемонта", "");
					СтруктураДанныеИзПисьма.Вставить("ОписаниеНеисправности", "");
					СтруктураДанныеИзПисьма.Вставить("Вложения", "");
					
					ЕстьОшибкиВДанных = Ложь;
					ТекстОшибки = "";
					Контрагент = Неопределено;
					ГрузимОписаниеНеисправности = Ложь;
					
					Если Не СтрНачинаетсяС(МассивСтрок[0],"----- Заявка на вызов сервисного инженера") Тогда 
						Продолжить; 
					КонецЕсли;
					
					Для Каждого СтрокаСообщения Из МассивСтрок Цикл
						 
						// ИНН
						ТекстПоиска = "ИНН вашей компании:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							СтруктураДанныеИзПисьма.ИНН = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							Если НЕ ЗначениеЗаполнено(СтруктураДанныеИзПисьма.ИНН) Тогда
								
								ЕстьОшибкиВДанных = Истина;
								ТекстОшибки = ТекстСообщенияНачало + "не найден ИНН контрагента";
								Контрагент = Справочники.Контрагенты.ПустаяСсылка();
								
							Иначе
								Контрагент = ПолучитьКонтрагентаПоИНН(СтруктураДанныеИзПисьма.ИНН);
							КонецЕсли;
							
							СтруктураДанныеИзПисьма.Контрагент = Контрагент;
							
						КонецЕсли;
						
						// Название компании
						ТекстПоиска = "Название вашей компании:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							СтруктураДанныеИзПисьма.КонтрагентИзПисьма = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);																				
						КонецЕсли;
						
						// Контактное лицо
						ТекстПоиска = "Контактное лицо:";
						КонтактноеЛицоСсылка = Неопределено;
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							НаименованиеКЛ = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.КонтактноеЛицоИзПисьма = НаименованиеКЛ;
							
						КонецЕсли;
						
						// Телефон Контактного лица
						ТекстПоиска = "Телефон для связи и получения sms-уведомления:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							ТелефонСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.ТелефонИзПисьма = ТелефонСтрока;
							
						КонецЕсли;
						
						// Почта Контактного лица
						ТекстПоиска = "E-mail:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							ПочтаСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.АдресЭПИзПисьма = ПочтаСтрока;
							КонтактноеЛицоСсылка = НайтиКонтактноеЛицоПоТелефонуИлиПочте(СтруктураДанныеИзПисьма);
							СтруктураДанныеИзПисьма.КонтактноеЛицо = КонтактноеЛицоСсылка;
							
						КонецЕсли;

						// Город
						ТекстПоиска = "Город:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							СтруктураДанныеИзПисьма.ГородИзПисьма = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
						КонецЕсли;
						
						// Регион
						ТекстПоиска = "Регион:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							СтруктураДанныеИзПисьма.Представительство = Справочники.СтруктураПредприятия.ПустаяСсылка();
							
							РегионИзПисьма = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							
							Если НЕ РегионИзПисьма = "" Тогда
								
								НайденныйРегион = НайтиРегион(РегионИзПисьма);
								
								Если ЗначениеЗаполнено(НайденныйРегион) Тогда
									
									БизнесРегионВерхнегоУровня = НайтиРегионВерхнегоУровня(НайденныйРегион);
									
									Если ЗначениеЗаполнено(БизнесРегионВерхнегоУровня) Тогда
									 
										СтруктураДанныеИзПисьма.Представительство = ?(ЗначениеЗаполнено(БизнесРегионВерхнегоУровня.смартОбслуживающееПодразделениеСЦ), 
											БизнесРегионВерхнегоУровня.смартОбслуживающееПодразделениеСЦ, БизнесРегионВерхнегоУровня.смартОтветственоеПодразделение);
										
									КонецЕсли;	
									
								КонецЕсли;
								
								Если СтруктураДанныеИзПисьма.Представительство = Справочники.СтруктураПредприятия.ПустаяСсылка() Тогда
									
									ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка Заявок на ремонтные работы из почты'", ОбщегоНазначения.КодОсновногоЯзыка()),
										УровеньЖурналаРегистрации.Ошибка, , 
										, "Загрузка Заявок на ремонтные работы из почты. Не удалось определить представительство по региону " + РегионИзПисьма + "!");
										
								КонецЕсли;		
							
							КонецЕсли;
							
						КонецЕсли;
						
						// Адрес
						ТекстПоиска = "Адрес выезда инженера:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							СтруктураДанныеИзПисьма.АдресИзПисьма = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
						КонецЕсли;
						
						// Оборудование
						ТекстПоиска = "Полное название оборудования:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							ОборудованиеСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.ОборудованиеКлиентовИзПисьма = ОборудованиеСтрока;
							
							Если ЗначениеЗаполнено(ОборудованиеСтрока) Тогда

								ОборудованиеСсылка = ПолучитьОборудованиеКлиентов(ОборудованиеСтрока);
																
								Если ЗначениеЗаполнено(ОборудованиеСсылка) Тогда
									
									//++ #Б-3478 смарт: Фролов 02.06.2025 //Загрузка заявок на ремонтные работы с учетом квалификаций инженеров СЦ,
									Если ЗначениеЗаполнено(СтруктураДанныеИзПисьма.Представительство)
										И НЕ СтруктураДанныеИзПисьма.Представительство = Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение Тогда
										
										Запрос = Новый Запрос(
										"ВЫБРАТЬ
										|	Инженер КАК Инженер
										|ИЗ
										|	РегистрСведений.смартВидыКвалификацийИнженеровСЦ
										|ГДЕ
										|	Оборудование = &Оборудование
										|	И Подразделение = &Подразделение
										|	И Ремонт");
										Запрос.УстановитьПараметр("Подразделение", СтруктураДанныеИзПисьма.Представительство);
										Запрос.УстановитьПараметр("Оборудование", ОборудованиеСсылка);
										
										Если Запрос.Выполнить().Пустой() Тогда
											
											СтруктураДанныеИзПисьма.Представительство = Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение;	
											
										КонецЕсли;	
										
									КонецЕсли;
									//-- #Б-3478 смарт: Фролов 02.06.2025
									
									СтруктураДанныеИзПисьма.ОборудованиеКлиентов = ОборудованиеСсылка;
									
								Иначе
									ТекстСообщения = ТекстСообщенияНачало + "не найдено оборудование с наименованием " + ОборудованиеСтрока;
									ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
								КонецЕсли;
								
							КонецЕсли;							
						КонецЕсли;

						// Серия
						ТекстПоиска = "Серийный номер оборудования:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							СерияСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.СерияИзПисьма = СерияСтрока;
							
							Если ЗначениеЗаполнено(СерияСтрока) Тогда

								мСерияСтрока = СерияСтрока;
								СерияСсылка = ПолучитьСерию(мСерияСтрока);
								
								Если ЗначениеЗаполнено(СерияСсылка) Тогда
									СтруктураДанныеИзПисьма.Серия = СерияСсылка;									
								Иначе
									ТекстСообщения = ТекстСообщенияНачало + "не найдена серия " + СерияСтрока;
									ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
								КонецЕсли;
								
							КонецЕсли;							
						КонецЕсли;

						// Наличие гарантии
						ТекстПоиска = "Наличие гарантии:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							СтруктураДанныеИзПисьма.НаличиеГарантии = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
						КонецЕсли;
						
						// Тип чернил
						ТекстПоиска = "Марка используемых чернил:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							ТипЧернилСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.ТипЧернилИзПисьма = ТипЧернилСтрока;
							
							Если ЗначениеЗаполнено(ТипЧернилСтрока) Тогда

								ТипЧернилСсылка = ПолучитьТипЧернил(ТипЧернилСтрока);
								
								Если ЗначениеЗаполнено(ТипЧернилСсылка) Тогда
									СтруктураДанныеИзПисьма.ТипЧернил = ТипЧернилСсылка;
								Иначе
									ТекстСообщения = ТекстСообщенияНачало + "не найден тип чернил с наименованием " + ТипЧернилСтрока;
									ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						// Конфигурация чернил
						ТекстПоиска = "Конфигурация чернил:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							КонфигурацияЧернилСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.КонфигурацияЧернилИзПисьма = КонфигурацияЧернилСтрока;
							
							Если ЗначениеЗаполнено(КонфигурацияЧернилСтрока) Тогда

								КонфигурацияЧернилСсылка = ПолучитьЭлементПоНаименованию(КонфигурацияЧернилСтрока, "смартКонфигурацииЧернил");
								
								Если ЗначениеЗаполнено(КонфигурацияЧернилСсылка) Тогда
									СтруктураДанныеИзПисьма.КонфигурацияЧернил = КонфигурацияЧернилСсылка;
								Иначе
									ТекстСообщения = ТекстСообщенияНачало + "не найдена конфигурация чернил с наименованием " + КонфигурацияЧернилСтрока;
									ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						// Растровый процессор
						ТекстПоиска = "Растровый процессор:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							
							РастровыйПроцессорСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.РастровыйПроцессорИзПисьма = РастровыйПроцессорСтрока;
							
							Если ЗначениеЗаполнено(РастровыйПроцессорСтрока) Тогда

								РастровыйПроцессорСсылка = ПолучитьЭлементПоНаименованию(РастровыйПроцессорСтрока, "смартРастровыеПроцессоры");
								
								Если ЗначениеЗаполнено(РастровыйПроцессорСсылка) Тогда
									СтруктураДанныеИзПисьма.РастровыйПроцессор = РастровыйПроцессорСсылка;
								Иначе
									ТекстСообщения = ТекстСообщенияНачало + "не найден растровый процессор наименованием " + РастровыйПроцессорСтрока;
									ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						// Желаемая дата ремонта 
						ТекстПоиска = "Укажите дату планируемого выезда инженера:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							ЖелаемаяДатаРемонтаСтрока = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							СтруктураДанныеИзПисьма.ЖелаемаяДатаРемонта = смартОбщегоНазначения.ПолучитьДатуИзСтроки(ЖелаемаяДатаРемонтаСтрока);
						КонецЕсли;
						
						// Описание неисправностей 
						ТекстПоиска = "Описание неисправностей:";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							СтруктураДанныеИзПисьма.ОписаниеНеисправности = ПолучитьЗначениеИзСтроки(СтрокаСообщения, ТекстПоиска);
							ГрузимОписаниеНеисправности = Истина;
							Продолжить;
						КонецЕсли;
						
						//конец сообщения
						ТекстПоиска = "ВНИМАНИЕ: Заказчик обязан обеспечить";
						Если СтрНайти(СтрокаСообщения, ТекстПоиска) <> 0 Тогда
							ГрузимОписаниеНеисправности = Ложь;
						ИначеЕсли ГрузимОписаниеНеисправности Тогда
							СтруктураДанныеИзПисьма.ОписаниеНеисправности = СтруктураДанныеИзПисьма.ОписаниеНеисправности + СокрЛП(СтрокаСообщения);
						КонецЕсли;
						
					КонецЦикла;

					Если ЕстьОшибкиВДанных Тогда
						ЗаписьЖурналаРегистрации(ИмяСобытияДляЖР(), УровеньЖурналаРегистрации.Информация,,, ТекстОшибки);
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);						
					КонецЕсли;
					
					Вложения = ТекущееСообщение.Вложения;
					
					Если Вложения.Количество() > 0 Тогда
						СтруктураДанныеИзПисьма.Вложения = Вложения;
					КонецЕсли;										
					
					Попытка
						СоздатьДокументЗаявкаНаРемонтныеРаботы(СтруктураДанныеИзПисьма, ДатаПисем, Организация);
					Исключение
						ОбщегоНазначения.СообщитьПользователю("Не создан документ по заявке " + Строка(НомерЗаявки));
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИнтернетПочта.Отключиться();
	
	Возврат МассивДокументов
	
КонецФункции

Функция ПолучитьНоменклатуруОборудования(Оборудование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартОборудованиеЧернилаКлиентов.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|ГДЕ
	|	смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов = &ОборудованиеКлиентов
	|	И смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром";
	
	Запрос.УстановитьПараметр("ОборудованиеКлиентов", Оборудование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область Служебные

Функция ИмяСобытияДляЖР() Экспорт
	Возврат "Смарт.ЗагрузкаЗаявокНаРемонтныеРаботыИзПочты";
КонецФункции

Функция ПолучитьЗначениеИзСтроки(знач СтрокаСообщения, НачалоСтроки)
	
	Возврат СокрЛП(СтрЗаменить(СтрокаСообщения, НачалоСтроки, ""));
	
КонецФункции

Функция ПолучитьЧистыйТекстИзHTML(знач ТекстHTML)
	
	Результат = ТекстHTML;
	Результат = СтрЗаменить(Результат, "<br>", Символы.ПС);
	
	Построитель = Новый ПостроительDOM;
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(Результат);
	ДокументHTML = Построитель.Прочитать(ЧтениеHTML); 
	
	Возврат ДокументHTML.Тело.ТекстовоеСодержимое;
	
КонецФункции

Функция ПолучитьКонтрагентаПоИНН(ИНН)
	
	Если НЕ ЗначениеЗаполнено(ИНН) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И НЕ Контрагенты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();

	Выборка.Следующий();
	
	Возврат	Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьКонтактноеЛицоПоНаименованию(Контрагент, НаименованиеКЛ)
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ НЕ ЗначениеЗаполнено(НаименованиеКЛ) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Наименование = &Наименование
	|	И КонтактныеЛицаПартнеров.Владелец = &Партнер
	|	И НЕ КонтактныеЛицаПартнеров.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеКЛ);
	Запрос.УстановитьПараметр("Партнер", Контрагент.Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция НайтиКонтактноеЛицоПоТелефонуИлиПочте(СтруктураДанныеИзПисьма)
	
	АдресЭПИзПисьма = СтруктураДанныеИзПисьма.АдресЭПИзПисьма;
	ТелефонИзПисьма = СтруктураДанныеИзПисьма.ТелефонИзПисьма;
	Контрагент 		= СтруктураДанныеИзПисьма.Контрагент;
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ (НЕ ЗначениеЗаполнено(АдресЭПИзПисьма) И НЕ ЗначениеЗаполнено(ТелефонИзПисьма)) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	НЕ КонтактнаяИнформация.Ссылка.ПометкаУдаления
	|	И КонтактнаяИнформация.Тип В(&ТипыКИ)
	|	И КонтактнаяИнформация.Ссылка.Владелец = &Партнер
	|ИТОГИ ПО
	|	Ссылка";
	
	ТипТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ТипПочта = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(ТипТелефон);
	ТипыКИ.Добавить(ТипПочта);
	
	Запрос.УстановитьПараметр("Партнер", Контрагент.Партнер);
	Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтактноеЛицо = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НайденноеКонтактноеЛицо = Неопределено;
	МаксимумСовпадений = 0;
	
	Пока ВыборкаКонтактноеЛицо.Следующий() Цикл
		
		КоличествоСовпадений = 0;
		
		АдресЭПКонтактногоЛица = "";
		ТелефонКонтактногоЛица = "";
		
		Выборка = ВыборкаКонтактноеЛицо.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Тип = ТипТелефон Тогда
				
				НайденноеЗначение = НайтиКонтактнуюИнформациюПоСовпадению(Выборка.Ссылка, ТелефонИзПисьма, Выборка.Тип, Выборка.Представление);
				
				ТелефонКонтактногоЛица = НайденноеЗначение;
				
				Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
					Продолжить;
				КонецЕсли;
											
			ИначеЕсли Выборка.Тип = ТипПочта Тогда
				
				НайденноеЗначение = НайтиКонтактнуюИнформациюПоСовпадению(Выборка.Ссылка, АдресЭПИзПисьма, Выборка.Тип, Выборка.Представление);
				
				АдресЭПКонтактногоЛица = НайденноеЗначение;
				
				Если НЕ ЗначениеЗаполнено(НайденноеЗначение) Тогда
					Продолжить;
				КонецЕсли;				
				
			КонецЕсли;
			
			КоличествоСовпадений = КоличествоСовпадений + 1;	
			
		КонецЦикла;
		
		Если КоличествоСовпадений > МаксимумСовпадений Тогда
			МаксимумСовпадений = КоличествоСовпадений;
			НайденноеКонтактноеЛицо = ВыборкаКонтактноеЛицо.Ссылка;
			СтруктураДанныеИзПисьма.АдресЭПКонтактногоЛица = АдресЭПКонтактногоЛица;
			СтруктураДанныеИзПисьма.ТелефонКонтактногоЛица = ТелефонКонтактногоЛица;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(НайденноеКонтактноеЛицо) Тогда
		
		НовоеКЛ = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
		НовоеКЛ.Владелец = Контрагент.Партнер;
		НовоеКЛ.Автор = ПараметрыСеанса.ТекущийПользователь;
		НовыйКонтакт = НовоеКЛ.КонтактнаяИнформация.Добавить();
		НовыйКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		НовыйКонтакт.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		НовыйКонтакт.АдресЭП = АдресЭПИзПисьма;
		НовыйКонтакт.Представление = АдресЭПИзПисьма;
		
		Если ЗначениеЗаполнено(СтруктураДанныеИзПисьма.КонтактноеЛицоИзПисьма) Тогда
			НовоеКЛ.Наименование = СтруктураДанныеИзПисьма.КонтактноеЛицоИзПисьма;
		ИначеЕсли ЗначениеЗаполнено(ТелефонИзПисьма) Тогда
			НовоеКЛ.Наименование = ТелефонИзПисьма;
		ИначеЕсли ЗначениеЗаполнено(АдресЭПИзПисьма) Тогда
			НовоеКЛ.Наименование = АдресЭПИзПисьма;
		КонецЕсли;
					
		НовоеКЛ.Комментарий = НСтр("ru = 'Создан автоматически при загрузке заявок на ремонтные работы из почты '") + ТекущаяДата();
		
		Если ЗначениеЗаполнено(АдресЭПИзПисьма) Тогда			
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ, АдресЭПИзПисьма, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица, ТекущаяДата(), Ложь); 			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТелефонИзПисьма) Тогда			
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(НовоеКЛ, ТелефонИзПисьма, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица, ТекущаяДата(), Ложь); 			
		КонецЕсли;
		
		НовоеКЛ.Записать();
		
		НайденноеКонтактноеЛицо = НовоеКЛ.Ссылка;
		
	КонецЕсли;
	
	Возврат НайденноеКонтактноеЛицо;
										
КонецФункции

Функция НайтиКонтактнуюИнформациюПоСовпадению(КонтактноеЛицо, СтрокаПоиска, ТипПоля, Представление = "")
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо)
		ИЛИ НЕ ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
	
	Если ТипПоля = ТипТелефон Тогда		
		СтрокаПоиска = ТолькоЦифры(СтрокаПоиска);
	КонецЕсли;
	
	Для Каждого КИ Из КонтактноеЛицо.КонтактнаяИнформация Цикл
		
		Если КИ.Тип <> ТипПоля Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Представление) 
			И КИ.Представление <> Представление Тогда
			Продолжить;
		КонецЕсли;
		
		Если КИ.Тип = ТипТелефон Тогда
			КИСтрока = ТолькоЦифры(КИ.Представление);
		Иначе
			КИСтрока = КИ.Представление;
		КонецЕсли;
		
		Если КИСтрока = СтрокаПоиска
			ИЛИ (ТипПоля = ТипТелефон И СтрДлина(КИСтрока) = 11 И Прав(КИСтрока, 10) = Прав(СтрокаПоиска, 10))
			ИЛИ СтрНайти(ВРег(КИСтрока), ВРег(СтрокаПоиска)) <> 0 Тогда
			
			Возврат КИ.Представление;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";

КонецФункции

Функция ПолучитьОборудованиеКлиентов(Наименование)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартОборудованиеКлиентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартОборудованиеКлиентов КАК смартОборудованиеКлиентов
	|ГДЕ
	|	смартОборудованиеКлиентов.Наименование = &Наименование
	|	И НЕ смартОборудованиеКлиентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьСерию(СерияСтрока)
	
	Если НЕ ЗначениеЗаполнено(СерияСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	НЕ СерииНоменклатуры.ПометкаУдаления
	|	И СерииНоменклатуры.Номер = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", СерияСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		СерияБезПробелов = СтрЗаменить(СерияСтрока, " ", "");
		Если СерияБезПробелов = СерияСтрока Тогда
			Возврат Неопределено;
		Иначе
			Возврат ПолучитьСерию(СерияБезПробелов);
		КонецЕсли;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипЧернил(ТипЧернилСтрока)
	
	Если НЕ ЗначениеЗаполнено(ТипЧернилСтрока) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартТипыЧернил.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартОборудованиеКлиентов КАК смартТипыЧернил
	|ГДЕ
	|	смартТипыЧернил.Наименование = &Наименование
	|	И НЕ смартТипыЧернил.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ТипЧернилСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;

КонецФункции

Функция ПолучитьЭлементПоНаименованию(НаименованиеЭлемента, ИмяСправочника)
	
	Если НЕ ЗначениеЗаполнено(НаименованиеЭлемента) ИЛИ НЕ ЗначениеЗаполнено(ИмяСправочника) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТекСправочник.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК ТекСправочник
	|ГДЕ
	|	ТекСправочник.Наименование = &Наименование
	|	И НЕ ТекСправочник.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеЭлемента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;

КонецФункции

Функция ТолькоЦифры(ВхСтрока)
	
	ВыхСтрока="";

	Для п = 1 По СтрДлина(ВхСтрока) Цикл

		Симв = Сред(ВхСтрока, п, 1);
		Если Симв >= "0" И Симв <= "9" Тогда
			ВыхСтрока = ВыхСтрока+Симв;
		КонецЕсли;

	КонецЦикла;

	Возврат ВыхСтрока;
   
КонецФункции

Функция ПроверитьНаличиеДокумента(НомерЗаявки, ДатаПисем)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	смартЗаявкаНаРемонтныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	|ГДЕ
	|	смартЗаявкаНаРемонтныеРаботы.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(смартЗаявкаНаРемонтныеРаботы.Дата, ГОД) = &ТекущийГод";
	
	Запрос.УстановитьПараметр("Номер", НомерЗаявки);
	Запрос.УстановитьПараметр("ТекущийГод", НачалоГода(ДатаПисем));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой()

КонецФункции

Функция СоздатьДокументЗаявкаНаРемонтныеРаботы(ПараметрыЗаполнения, ДатаПисем, Организация)
	
	ДатаДокумента = ТекущаяДата();
	
	Если НачалоДня(ДатаДокумента) <> НачалоДня(ДатаПисем) Тогда
		ДатаДокумента = ДатаПисем;
	КонецЕсли;
	
	НовыйДокумент = Документы.смартЗаявкаНаРемонтныеРаботы.СоздатьДокумент();
	НовыйДокумент.Организация 	= Организация;
	НовыйДокумент.Дата 			= ДатаДокумента;
	НовыйДокумент.Номер 		= ПараметрыЗаполнения.Номер;
	НовыйДокумент.Контрагент 	= ПараметрыЗаполнения.Контрагент;
	НовыйДокумент.Партнер 		= НовыйДокумент.Контрагент.Партнер;
	НовыйДокумент.Комментарий 	= "#Загружено из электронной почты";
	НовыйДокумент.Представительство = ПараметрыЗаполнения.Представительство;
	
	//++ #Б-3478 смарт: Фролов 02.06.2025 //Загрузка заявок на ремонтные работы с учетом квалификаций инженеров СЦ,
	//НовыйДокумент.Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.НоваяЗаявка;
	Если НовыйДокумент.Представительство = Справочники.смартПредопределенныеЗначения.ПодразделениеГоловнойОфисМосква.Значение Тогда;
		
		НовыйДокумент.Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.НоваяЗаявка;
		
	Иначе
		
		НовыйДокумент.Статус = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ОтправленаВПредставительство;
	
	КонецЕсли;
	//-- #Б-3478 смарт: Фролов 02.06.2025
	
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	АдресВыездаИзПисьма = ?(ЗначениеЗаполнено(ПараметрыЗаполнения.ГородИзПисьма), ПараметрыЗаполнения.ГородИзПисьма + ", ", "") + ПараметрыЗаполнения.АдресИзПисьма;
	НовыйДокумент.АдресВыезда = АдресВыездаИзПисьма;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.Контрагент) Тогда
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.ИНН) Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "ИНН: " + ПараметрыЗаполнения.ИНН;
													
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.КонтрагентИзПисьма) Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "Наименование контрагента: " + ПараметрыЗаполнения.КонтрагентИзПисьма;
													
		КонецЕсли;

	КонецЕсли;	
	
	// Контактные лица
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.КонтактноеЛицо) Тогда
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.КонтактноеЛицоИзПисьма) Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "Контактное лицо: " + ПараметрыЗаполнения.КонтактноеЛицоИзПисьма;
													
		КонецЕсли;
		
	Иначе
		
		НоваяСтрока = НовыйДокумент.КонтактныеЛица.Добавить();
		НоваяСтрока.КонтактноеЛицо = ПараметрыЗаполнения.КонтактноеЛицо;
		
		СтруктураДанныеКонтактногоЛица = НовыйДокумент.ПолучитьДанныеКонтактногоЛица(НоваяСтрока.КонтактноеЛицо);
		НоваяСтрока.АдресЭПКонтактногоЛица = СтруктураДанныеКонтактногоЛица.ЭлПочта;
		НоваяСтрока.ТелефонКонтактногоЛица = СтруктураДанныеКонтактногоЛица.Телефон;
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.АдресЭПКонтактногоЛица) 
			И НоваяСтрока.АдресЭПКонтактногоЛица <> ПараметрыЗаполнения.АдресЭПКонтактногоЛица Тогда
			
			НоваяСтрока.АдресЭПКонтактногоЛица = ПараметрыЗаполнения.АдресЭПКонтактногоЛица;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.ТелефонКонтактногоЛица) 
			И НоваяСтрока.ТелефонКонтактногоЛица <> ПараметрыЗаполнения.ТелефонКонтактногоЛица Тогда
			
			НоваяСтрока.ТелефонКонтактногоЛица = ПараметрыЗаполнения.ТелефонКонтактногоЛица;
			
		КонецЕсли;
		
		Если ПараметрыЗаполнения.КонтактноеЛицо.Наименование <> ПараметрыЗаполнения.КонтактноеЛицоИзПисьма  Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "Контактное лицо: " + ПараметрыЗаполнения.КонтактноеЛицоИзПисьма;

		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.АдресЭПКонтактногоЛица) 
		И ЗначениеЗаполнено(ПараметрыЗаполнения.АдресЭПИзПисьма) Тогда
		
		НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
												+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
												+ "E-mail контактного лица: " + ПараметрыЗаполнения.АдресЭПИзПисьма;

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ТелефонКонтактногоЛица) 
		И ЗначениеЗаполнено(ПараметрыЗаполнения.ТелефонИзПисьма) Тогда
		
		НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
												+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
												+ "Телефон для связи и получения sms-уведомления контактного лица: " + ПараметрыЗаполнения.ТелефонИзПисьма;
												
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ОборудованиеКлиентов) Тогда
		
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.ОборудованиеКлиентовИзПисьма) Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "Полное название оборудования: " + ПараметрыЗаполнения.ОборудованиеКлиентовИзПисьма;
													
		КонецЕсли;
		
	Иначе
		
		НоваяСтрока = НовыйДокумент.Оборудование.Добавить();
		НоваяСтрока.ОборудованиеКлиентов = ПараметрыЗаполнения.ОборудованиеКлиентов;
		НоваяСтрока.Серия = ПараметрыЗаполнения.Серия;
		
		СтруктураВозврата = НовыйДокумент.ПолучитьДанныеПоСерии(НоваяСтрока.Серия);
		ОсновнаяНоменклатура = ПолучитьНоменклатуруОборудования(ПараметрыЗаполнения.ОборудованиеКлиентов);
		Если ЗначениеЗаполнено(ОсновнаяНоменклатура) Тогда
			 НоваяСтрока.Оборудование = ОсновнаяНоменклатура;
		Иначе
			НоваяСтрока.Оборудование = СтруктураВозврата.Номенклатура;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Оборудование) Тогда
			НоваяСтрока.Оборудование = Справочники.Номенклатура.НайтиПоНаименованию("Не определена (для заявок на ремонт)", Истина);
		КонецЕсли;
		
		НоваяСтрока.ДатаОтгрузки            = СтруктураВозврата.ДатаОтгрузки;
		НоваяСтрока.ТипЧернилОборудование 				= ПараметрыЗаполнения.ТипЧернил;
		
		НоваяСтрока.РастровыйПроцессор 		= ПараметрыЗаполнения.РастровыйПроцессор;
		НоваяСтрока.КонфигурацияЧернил 		= ПараметрыЗаполнения.КонфигурацияЧернил;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.Контрагент) И ЗначениеЗаполнено(СтруктураВозврата.Контрагент) Тогда 
			НовыйДокумент.Контрагент = СтруктураВозврата.Контрагент;
			НовыйДокумент.Партнер    = НовыйДокумент.Контрагент.Партнер;
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.Серия)
			И ЗначениеЗаполнено(ПараметрыЗаполнения.СерияИзПисьма) Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "Серийный номер оборудования: " + ПараметрыЗаполнения.СерияИзПисьма;

		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.ТипЧернил)
			И ЗначениеЗаполнено(ПараметрыЗаполнения.ТипЧернилИзПисьма) Тогда
			
			НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования 
													+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
													+ "Марка используемых чернил: " + ПараметрыЗаполнения.ТипЧернилИзПисьма;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.НаличиеГарантии) Тогда
		
		Если ВРег(ПараметрыЗаполнения.НаличиеГарантии) = "ДА" Тогда
			
			НомерЗаявкиПНР = "";
			
			Если СрокГарантииИстек(ПараметрыЗаполнения, НомерЗаявкиПНР) Тогда
				
				НовыйДокумент.ВидГарантии = Перечисления.смартВидыГарантии.Платная;
				НовыйДокумент.ДанныеИзПисьмаОснования = НовыйДокумент.ДанныеИзПисьмаОснования
														+ ?(ЗначениеЗаполнено(НовыйДокумент.ДанныеИзПисьмаОснования), Символы.ПС, "")
														+ "В форме указали, что случай гарантийный, но по данным заявки на ПНР " + НомерЗаявкиПНР + " срок гарантии истек";
				
			Иначе
				НовыйДокумент.ВидГарантии = Перечисления.смартВидыГарантии.Гарантия;
			КонецЕсли;
			
		Иначе
			НовыйДокумент.ВидГарантии = Перечисления.смартВидыГарантии.Платная;
		КонецЕсли;
		
	Иначе	
		НовыйДокумент.ВидГарантии = Перечисления.смартВидыГарантии.Платная;
	КонецЕсли;
	
	НовыйДокумент.ЖелаемаяДатаРемонта = ПараметрыЗаполнения.ЖелаемаяДатаРемонта;
	НовыйДокумент.ОписаниеНеисправности = ПараметрыЗаполнения.ОписаниеНеисправности;
		
	//++ #Б-3570 смарт: Фролов 17.06.2025 //При загрузке ЗРР из почты сделать их проведенными.
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;	
	//-- #Б-3570 смарт: Фролов 17.06.2025
	
	// Присоединить файлы
	Если ПараметрыЗаполнения.Вложения <> "" Тогда
		
		Для Каждого ИнтернетПочтовоеВложение Из ПараметрыЗаполнения.Вложения Цикл
			
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
			ПараметрыФайла.ВладелецФайлов = НовыйДокумент.Ссылка;
			
			РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИнтернетПочтовоеВложение.ИмяФайла);
			
			ПараметрыФайла.РасширениеБезТочки = РасширениеБезТочки;
			ПараметрыФайла.ИмяБезРасширения = СтрЗаменить(ИнтернетПочтовоеВложение.ИмяФайла, "." + РасширениеБезТочки, "");			
			
			АдресВХранилище = ПоместитьВоВременноеХранилище(ИнтернетПочтовоеВложение.Данные);
			
			РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

Функция СрокГарантииИстек(ПараметрыЗаполнения, НомерЗаявкиПНР = "")
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	смартЗаявкаНаПускоНаладкуОборудование.ГарантийныйСрокНаОборудование КАК ГарантийныйСрокНаОборудование,
	|	смартЗаявкаНаПускоНаладкуОборудование.ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаНаПНР,
	|	ЕСТЬNULL(смартГарантийныеСрокиНаОборудование.КоличествоМесяцев, 0) КАК КоличествоМесяцев,
	|	смартЗаявкаНаПускоНаладкуОборудование.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК смартЗаявкаНаПускоНаладкуОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартГарантийныеСрокиНаОборудование КАК смартГарантийныеСрокиНаОборудование
	|		ПО смартЗаявкаНаПускоНаладкуОборудование.ГарантийныйСрокНаОборудование = смартГарантийныеСрокиНаОборудование.Ссылка
	|ГДЕ
	|	НЕ смартЗаявкаНаПускоНаладкуОборудование.Ссылка.ПометкаУдаления
	|	И смартЗаявкаНаПускоНаладкуОборудование.ОборудованиеКлиентов = &ОборудованиеКлиентов
	|	И смартЗаявкаНаПускоНаладкуОборудование.Серия = &Серия";
	
	Запрос.УстановитьПараметр("Серия", ПараметрыЗаполнения.Серия);
	Запрос.УстановитьПараметр("ОборудованиеКлиентов", ПараметрыЗаполнения.ОборудованиеКлиентов);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ДобавитьМесяц(Выборка.ДатаПодписанияАктаНаПНР, Выборка.КоличествоМесяцев) < НачалоДня(ТекущаяДата()) Тогда
			Результат = Истина;
			НомерЗаявкиПНР = Выборка.Номер;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиРегион(СтрокаРегион)
	
	БизнесРегион = Справочники.БизнесРегионы.НайтиПоНаименованию(СтрокаРегион);
	Если ЗначениеЗаполнено(БизнесРегион) Тогда
		Возврат БизнесРегион;	
	КонецЕсли;	
	
	Если СтрокаРегион = "Респ Крым" Тогда
		Возврат Справочники.БизнесРегионы.НайтиПоНаименованию("Крым Респ");	
	КонецЕсли;
	
	Если СтрокаРегион = "г Москва" Тогда
		Возврат Справочники.БизнесРегионы.НайтиПоНаименованию("Москва (регион)");	
	КонецЕсли; 
	
	Если СтрокаРегион = "г Санкт-Петербург" Тогда
		Возврат Справочники.БизнесРегионы.НайтиПоНаименованию("Санкт-Петербург (регион)");
	КонецЕсли;
	
	Если СтрокаРегион = "Ленинградская обл" Тогда
		Возврат Справочники.БизнесРегионы.НайтиПоНаименованию("Ленинградская обл");
	КонецЕсли;
	
	СтрокаРегион1 = СтрЗаменить(СтрокаРегион," (Адыгея)", "");
	СтрокаРегион1 = СтрЗаменить(СтрокаРегион,"Край", "");
	СтрокаРегион1 = СтрЗаменить(СтрокаРегион,"Город", "");
	СтрокаРегион1 = СтрЗаменить(СтрокаРегион,"г.", "");
	СтрокаРегион2 = СтрЗаменить(СтрокаРегион1,"Область", "");
	СтрокаРегион3 = СтрЗаменить(СтрокаРегион2,"Республика", "");
	СтрокаРегион3 = СтрЗаменить(СтрокаРегион2,"Респ", "");
  
	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРегион3, " ");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БизнесРегионы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БизнесРегионы КАК БизнесРегионы
	|ГДЕ
	|	БизнесРегионы.Наименование ПОДОБНО &Регион
	|	И НЕ БизнесРегионы.ПометкаУдаления");
	
	Для Каждого СтрМассивПодстрок Из МассивПодстрок Цикл
		
		Запрос.УстановитьПараметр("Регион", "%" + СтрМассивПодстрок + "%");
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() ТОгда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Справочники.БизнесРегионы.ПустаяСсылка();
	
КонецФункции

Функция НайтиРегионВерхнегоУровня(Регион)
	
	РегионПоиска = Регион;
	
	Пока ЗначениеЗаполнено(РегионПоиска.Родитель) И НЕ ЗначениеЗаполнено(РегионПоиска.смартОбслуживающееПодразделениеСЦ) Цикл
		РегионПоиска = НайтиРегионВерхнегоУровня(РегионПоиска.Родитель);
	КонецЦикла;
	
	Возврат РегионПоиска;
	
КонецФункции

#КонецОбласти
